----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
         Rearrange-1               [-1, 49, 48]               0
         LayerNorm-2               [-1, 49, 48]              96
            Linear-3              [-1, 49, 128]           6,272
         LayerNorm-4              [-1, 49, 128]             256
         LayerNorm-5              [-1, 50, 128]             256
            Linear-6              [-1, 50, 128]          16,384
            Linear-7              [-1, 50, 128]          16,384
            Linear-8              [-1, 50, 128]          16,384
           Dropout-9            [-1, 4, 50, 64]               0
           Linear-10              [-1, 50, 128]          16,512
LinformerSelfAttention-11              [-1, 50, 128]               0
          PreNorm-12              [-1, 50, 128]               0
        LayerNorm-13              [-1, 50, 128]             256
           Linear-14              [-1, 50, 512]          66,048
             GELU-15              [-1, 50, 512]               0
          Dropout-16              [-1, 50, 512]               0
           Linear-17              [-1, 50, 128]          65,664
      FeedForward-18              [-1, 50, 128]               0
          PreNorm-19              [-1, 50, 128]               0
        LayerNorm-20              [-1, 50, 128]             256
           Linear-21              [-1, 50, 128]          16,384
           Linear-22              [-1, 50, 128]          16,384
           Linear-23              [-1, 50, 128]          16,384
          Dropout-24            [-1, 4, 50, 64]               0
           Linear-25              [-1, 50, 128]          16,512
LinformerSelfAttention-26              [-1, 50, 128]               0
          PreNorm-27              [-1, 50, 128]               0
        LayerNorm-28              [-1, 50, 128]             256
           Linear-29              [-1, 50, 512]          66,048
             GELU-30              [-1, 50, 512]               0
          Dropout-31              [-1, 50, 512]               0
           Linear-32              [-1, 50, 128]          65,664
      FeedForward-33              [-1, 50, 128]               0
          PreNorm-34              [-1, 50, 128]               0
        LayerNorm-35              [-1, 50, 128]             256
           Linear-36              [-1, 50, 128]          16,384
           Linear-37              [-1, 50, 128]          16,384
           Linear-38              [-1, 50, 128]          16,384
          Dropout-39            [-1, 4, 50, 64]               0
           Linear-40              [-1, 50, 128]          16,512
LinformerSelfAttention-41              [-1, 50, 128]               0
          PreNorm-42              [-1, 50, 128]               0
        LayerNorm-43              [-1, 50, 128]             256
           Linear-44              [-1, 50, 512]          66,048
             GELU-45              [-1, 50, 512]               0
          Dropout-46              [-1, 50, 512]               0
           Linear-47              [-1, 50, 128]          65,664
      FeedForward-48              [-1, 50, 128]               0
          PreNorm-49              [-1, 50, 128]               0
        LayerNorm-50              [-1, 50, 128]             256
           Linear-51              [-1, 50, 128]          16,384
           Linear-52              [-1, 50, 128]          16,384
           Linear-53              [-1, 50, 128]          16,384
          Dropout-54            [-1, 4, 50, 64]               0
           Linear-55              [-1, 50, 128]          16,512
LinformerSelfAttention-56              [-1, 50, 128]               0
          PreNorm-57              [-1, 50, 128]               0
        LayerNorm-58              [-1, 50, 128]             256
           Linear-59              [-1, 50, 512]          66,048
             GELU-60              [-1, 50, 512]               0
          Dropout-61              [-1, 50, 512]               0
           Linear-62              [-1, 50, 128]          65,664
      FeedForward-63              [-1, 50, 128]               0
          PreNorm-64              [-1, 50, 128]               0
        LayerNorm-65              [-1, 50, 128]             256
           Linear-66              [-1, 50, 128]          16,384
           Linear-67              [-1, 50, 128]          16,384
           Linear-68              [-1, 50, 128]          16,384
          Dropout-69            [-1, 4, 50, 64]               0
           Linear-70              [-1, 50, 128]          16,512
LinformerSelfAttention-71              [-1, 50, 128]               0
          PreNorm-72              [-1, 50, 128]               0
        LayerNorm-73              [-1, 50, 128]             256
           Linear-74              [-1, 50, 512]          66,048
             GELU-75              [-1, 50, 512]               0
          Dropout-76              [-1, 50, 512]               0
           Linear-77              [-1, 50, 128]          65,664
      FeedForward-78              [-1, 50, 128]               0
          PreNorm-79              [-1, 50, 128]               0
        LayerNorm-80              [-1, 50, 128]             256
           Linear-81              [-1, 50, 128]          16,384
           Linear-82              [-1, 50, 128]          16,384
           Linear-83              [-1, 50, 128]          16,384
          Dropout-84            [-1, 4, 50, 64]               0
           Linear-85              [-1, 50, 128]          16,512
LinformerSelfAttention-86              [-1, 50, 128]               0
          PreNorm-87              [-1, 50, 128]               0
        LayerNorm-88              [-1, 50, 128]             256
           Linear-89              [-1, 50, 512]          66,048
             GELU-90              [-1, 50, 512]               0
          Dropout-91              [-1, 50, 512]               0
           Linear-92              [-1, 50, 128]          65,664
      FeedForward-93              [-1, 50, 128]               0
          PreNorm-94              [-1, 50, 128]               0
        LayerNorm-95              [-1, 50, 128]             256
           Linear-96              [-1, 50, 128]          16,384
           Linear-97              [-1, 50, 128]          16,384
           Linear-98              [-1, 50, 128]          16,384
          Dropout-99            [-1, 4, 50, 64]               0
          Linear-100              [-1, 50, 128]          16,512
LinformerSelfAttention-101              [-1, 50, 128]               0
         PreNorm-102              [-1, 50, 128]               0
       LayerNorm-103              [-1, 50, 128]             256
          Linear-104              [-1, 50, 512]          66,048
            GELU-105              [-1, 50, 512]               0
         Dropout-106              [-1, 50, 512]               0
          Linear-107              [-1, 50, 128]          65,664
     FeedForward-108              [-1, 50, 128]               0
         PreNorm-109              [-1, 50, 128]               0
       LayerNorm-110              [-1, 50, 128]             256
          Linear-111              [-1, 50, 128]          16,384
          Linear-112              [-1, 50, 128]          16,384
          Linear-113              [-1, 50, 128]          16,384
         Dropout-114            [-1, 4, 50, 64]               0
          Linear-115              [-1, 50, 128]          16,512
LinformerSelfAttention-116              [-1, 50, 128]               0
         PreNorm-117              [-1, 50, 128]               0
       LayerNorm-118              [-1, 50, 128]             256
          Linear-119              [-1, 50, 512]          66,048
            GELU-120              [-1, 50, 512]               0
         Dropout-121              [-1, 50, 512]               0
          Linear-122              [-1, 50, 128]          65,664
     FeedForward-123              [-1, 50, 128]               0
         PreNorm-124              [-1, 50, 128]               0
SequentialSequence-125              [-1, 50, 128]               0
       Linformer-126              [-1, 50, 128]               0
        Identity-127                  [-1, 128]               0
       LayerNorm-128                  [-1, 128]             256
          Linear-129                    [-1, 8]           1,032
================================================================
Total params: 1,591,016
Trainable params: 1,591,016
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 10.00
Params size (MB): 6.07
Estimated Total Size (MB): 16.08
----------------------------------------------------------------
